import pkg from 'lodash';
const { _ } = pkg;
import { MOBILE_UA } from '../../util/misc.js';
import req from '../../util/req.js';
import CryptoJS from 'crypto-js';

let key = '央视网 - CNTV';
let HOST = 'http://api.cntv.cn';

async function request(reqUrl) {
 let resp = await req.get(reqUrl, {
  headers: {
   'User-Agent': MOBILE_UA,
  },
 });
 return resp.data;
}

async function init(inReq, _outResp) {
 return {};
}

async function home(inReq, _outResp) {
 let classes = [
  { type_id: '101', type_name: '热播' },
  { type_id: '1', type_name: 'CCTV-1 综合' },
  { type_id: '2', type_name: 'CCTV-2 财经' },
  { type_id: '3', type_name: 'CCTV-3 综艺' },
  { type_id: '4', type_name: 'CCTV-4 中文国际' },
  { type_id: '5', type_name: 'CCTV-5 体育' },
  { type_id: '50', type_name: 'CCTV-5+ 体育赛事' },
  { type_id: '6', type_name: 'CCTV-6 电影' },
  { type_id: '7', type_name: 'CCTV-7 国防军事' },
  { type_id: '8', type_name: 'CCTV-8 电视剧' },
  { type_id: '9', type_name: 'CCTV-9 纪录' },
  { type_id: '10', type_name: 'CCTV-10 科教' },
  { type_id: '11', type_name: 'CCTV-11 戏曲' },
  { type_id: '12', type_name: 'CCTV-12 社会与法' },
  { type_id: '13', type_name: 'CCTV-13 新闻' },
  { type_id: '14', type_name: 'CCTV-14 少儿' },
  { type_id: '15', type_name: 'CCTV-15 音乐' },
  { type_id: '16', type_name: 'CCTV-16 奥林匹克' },
  { type_id: '17', type_name: 'CCTV-17 农业农村' },
  { type_id: '100', type_name: '其他' },
 ];
 let filterObj = {
  101: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451464665008914',
    value: [
     { n: '今日说法', v: 'TOPC1451464665008914' },
     { n: '一线', v: 'TOPC1451543462858283' },
     { n: '天网', v: 'TOPC1451543228296920' },
     { n: '法律讲堂（生活版）', v: 'TOPC1451542824484472' },
     { n: '法律讲堂（文史版）', v: 'TOPC1451542861682530' },
     { n: '方圆剧阵', v: 'TOPC1571217727564820' },
     { n: '热线12', v: 'TOPC1451543168050863' },
     { n: '现场', v: 'TOPC1571301089686775' },
     { n: '见证', v: 'TOPC1451542933238628' },
     { n: '法治深壹度', v: 'TOPC1571535828826169' },
     { n: '焦点访谈', v: 'TOPC1451558976694518' },
     { n: '共同关注', v: 'TOPC1451558858788377' },
     { n: '东方时空', v: 'TOPC1451558532019883' },
     { n: '法治在线', v: 'TOPC1451558590627940' },
     { n: '新闻调查', v: 'TOPC1451558819463311' },
     { n: '每周质量报告', v: 'TOPC1451558650605123' },
    ],
   },
  ],
  1: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451528971114112',
    value: [
     { n: '新闻联播', v: 'TOPC1451528971114112' },
     { n: '今日说法', v: 'TOPC1451464665008914' },
     { n: '等着我', v: 'TOPC1451378757637200' },
     { n: '开讲啦', v: 'TOPC1451464884159276' },
     { n: '晚间新闻', v: 'TOPC1451528792881669' },
     { n: '动物世界', v: 'TOPC1451378967257534' },
     { n: '人与自然', v: 'TOPC1451525103989666' },
     { n: '第一动画乐园', v: 'TOPC1451378857272262' },
     { n: '生活圈', v: 'TOPC1451546588784893' },
     { n: '生活提示', v: 'TOPC1451526037568184' },
     { n: '正大综艺', v: 'TOPC1650782829200997' },
     { n: '人口', v: 'TOPC1451466072378425' },
     { n: '秘境之眼', v: 'TOPC1554187056533820' },
     { n: '中华民族', v: 'TOPC1451525460925648' },
     { n: '国际艺苑', v: 'TOPC1451379250581117' },
     { n: '典籍里的中国', v: 'TOPC1611740341987572' },
     { n: '正大综艺·动物来啦', v: 'TOPC1452063879122866' },
     { n: '时代楷模发布厅', v: 'TOPC1557892390700355' },
     { n: '故事里的中国（第三季）', v: 'TOPC1636516276237257' },
     { n: '故事里的中国（第二季）', v: 'TOPC1601362002656197' },
     { n: '我有传家宝', v: 'TOPC1451525396109388' },
     { n: '经典咏流传第四季', v: 'TOPC1609224200063452' },
     { n: '挑战不可能第五季', v: 'TOPC1579169060379297' },
     { n: '我们有一套', v: 'TOPC1451527089955940' },
     { n: '收藏传奇', v: 'TOPC1451526640730841' },
     { n: '为了你', v: 'TOPC1451527001597710' },
     { n: '环球科技视野', v: 'TOPC1451463780801881' },
     { n: '分秒必争', v: 'TOPC1451379074008632' },
     { n: '小崔说事', v: 'TOPC1451527366158622' },
     { n: '首席夜话', v: 'TOPC1451526803363401' },
     { n: '梦想星搭档第二季', v: 'TOPC1451465396647639' },
     { n: '加油！向未来第三季', v: 'TOPC1529481290257961' },
     { n: '朗读者第二季', v: 'TOPC1524537559591830' },
     { n: '机智过人第三季', v: 'TOPC1564019920570762' },
     { n: '挑战不可能之加油中国', v: 'TOPC1547519813971570' },
     { n: '出彩中国人第三季', v: 'TOPC1494403550438128' },
     { n: '精彩一刻', v: 'TOPC1451464786232149' },
     { n: '挑战不可能第三季', v: 'TOPC1509500865106312' },
     { n: 'CCTV家庭幽默大赛', v: 'TOPC1451375222891702' },
     { n: '加油！向未来第二季', v: 'TOPC1499840226761151' },
     { n: '星光大道', v: 'TOPC1451467630488780' },
     { n: '生活早参考', v: 'TOPC1451525302140236' },
     { n: '挑战不可能第一季', v: 'TOPC1452063816677656' },
     { n: '挑战不可能第二季', v: 'TOPC1474277421637816' },
     { n: '经典咏流传第一季', v: 'TOPC1513676755770201' },
     { n: '欢乐中国人第二季', v: 'TOPC1516784350726581' },
     { n: '经典咏流传第二季', v: 'TOPC1547521714115947' },
     { n: '机智过人第三季', v: 'TOPC1564019920570762' },
     { n: '故事里的中国第一季', v: 'TOPC1569729252342702' },
     { n: '经济半小时', v: 'TOPC1601362002656197' },
    ],
   },
  ],
  2: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451530259915198',
    value: [
     { n: '第一时间', v: 'TOPC1451530259915198' },
     { n: '对话', v: 'TOPC1451530382483536' },
     { n: '天下财经', v: 'TOPC1451531385787654' },
     { n: '经济大讲堂', v: 'TOPC1451533652476962' },
     { n: '经济信息联播', v: 'TOPC1451533782742171' },
     { n: '是真的吗', v: 'TOPC1451534366388377' },
     { n: '正点财经', v: 'TOPC1453100395512779' },
     { n: '生活家', v: 'TOPC1593419181674791' },
    ],
   },
  ],
  3: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451465894294259',
    value: [
     { n: '开门大吉', v: 'TOPC1451465894294259' },
     { n: '多彩少年', v: 'TOPC1451467940101208' },
     { n: '黄金100秒', v: 'TOPC1451468496522494' },
     { n: '回声嘹亮', v: 'TOPC1451535575561597' },
     { n: '天天把歌唱', v: 'TOPC1451535663610626' },
     { n: '文化大百科', v: 'TOPC1451536035602751' },
     { n: '文化视点', v: 'TOPC1451536118642783' },
     { n: '文化正午', v: 'TOPC1451538455169283' },
     { n: '我爱满堂彩', v: 'TOPC1451538709371329' },
     { n: '舞蹈世界', v: 'TOPC1451547605511387' },
     { n: '大魔术师', v: 'TOPC1451984047073332' },
     { n: '动物传奇', v: 'TOPC1451984181884527' },
     { n: '向幸福出发', v: 'TOPC1451984638791216' },
     { n: '幸福账单', v: 'TOPC1451984801613379' },
     { n: '艺览天下', v: 'TOPC1451984851125433' },
     { n: '艺术人生', v: 'TOPC1451984891490556' },
     { n: '来故居听书', v: 'TOPC1451985071887935' },
     { n: '全家好拍档', v: 'TOPC1474275463547690' },
     { n: '朗读者第一季', v: 'TOPC1487120479377477' },
     { n: '综艺头条', v: 'TOPC1569226855085860' },
     { n: '走在回家的路上', v: 'TOPC1577697653272281' },
     { n: '我的艺术清单', v: 'TOPC1582272259917160' },
     { n: '喜上加喜', v: 'TOPC1590026042145705' },
     { n: '中国文艺报道', v: 'TOPC1601348042760302' },
     { n: '你好生活第二季', v: 'TOPC1604397385056621' },
     { n: '金牌喜剧班', v: 'TOPC1611826337610628' },
     { n: '你好生活第三季', v: 'TOPC1627961377879898' },
    ],
   },
  ],
  4: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451539822927345',
    value: [
     { n: '华人世界', v: 'TOPC1451539822927345' },
     { n: '中国新闻', v: 'TOPC1451539894330405' },
     { n: '国宝档案', v: 'TOPC1451540268188575' },
     { n: '海峡两岸', v: 'TOPC1451540328102649' },
     { n: '今日关注', v: 'TOPC1451540389082713' },
     { n: '今日亚洲', v: 'TOPC1451540448405749' },
     { n: '流行无限', v: 'TOPC1451540644606949' },
     { n: '深度国际', v: 'TOPC1451540709098112' },
     { n: '体育在线', v: 'TOPC1451540777295250' },
     { n: '天涯共此时', v: 'TOPC1451540858793305' },
     { n: '外国人在中国', v: 'TOPC1451541113743615' },
     { n: '文明之旅', v: 'TOPC1451541205513705' },
     { n: '远方的家', v: 'TOPC1451541349400938' },
     { n: '中华情', v: 'TOPC1451541564922207' },
     { n: '中华医药', v: 'TOPC1451541666791291' },
     { n: '走遍中国', v: 'TOPC1451542134053698' },
     { n: '国家记忆', v: 'TOPC1473235107169415' },
     { n: '今日环球', v: 'TOPC1571034705435323' },
     { n: '美食中国', v: 'TOPC1571034804976375' },
     { n: '国宝发现', v: 'TOPC1571034869935436' },
     { n: '环球综艺秀', v: 'TOPC1571300682556971' },
     { n: '华人故事', v: 'TOPC1571646754621556' },
     { n: '中国缘', v: 'TOPC1571646819318596' },
     { n: '记住乡愁第六季', v: 'TOPC1577672009520911' },
     { n: '记住乡愁第七季', v: 'TOPC1608533695279753' },
     { n: '鲁健访谈', v: 'TOPC1609904361007481' },
     { n: '记住乡愁第八季', v: 'TOPC1640330887412898' },
     { n: '国宝·发现', v: 'TOPC1571034869935436' },
    ],
   },
  ],
  5: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451548615930237',
    value: [
     { n: 'NBA最前线', v: 'TOPC1451548615930237' },
     { n: '冠军欧洲', v: 'TOPC1451549411228903' },
     { n: '巅峰时刻', v: 'TOPC1451549547540149' },
     { n: '健身动起来', v: 'TOPC1451549599140203' },
     { n: '篮球公园', v: 'TOPC1451549958391444' },
     { n: '欧冠开场哨', v: 'TOPC1451550484638864' },
     { n: '棋牌乐', v: 'TOPC1451550531682936' },
     { n: '赛车时代', v: 'TOPC1451550589995997' },
     { n: '谁是球王', v: 'TOPC1451550868295303' },
     { n: '体坛快讯', v: 'TOPC1451550970356385' },
     { n: '体育晨报', v: 'TOPC1451551258388672' },
     { n: '体育人间', v: 'TOPC1451551310742737' },
     { n: '体育世界', v: 'TOPC1451551371554333' },
     { n: '体育新闻', v: 'TOPC1451551426170389' },
     { n: '天下足球', v: 'TOPC1451551777876756' },
     { n: '体谈', v: 'TOPC1451551830518827' },
     { n: '武林大会', v: 'TOPC1451551891055866' },
     { n: '运动大不同', v: 'TOPC1451552002869953' },
     { n: '足球之夜', v: 'TOPC1451552481492403' },
     { n: '冰球冰球', v: 'TOPC1551323337921620' },
     { n: '冰天雪地', v: 'TOPC1551323403033398' },
     { n: 'ATP周刊', v: 'TOPC1551324792732798' },
     { n: '约战果岭', v: 'TOPC1551324843068553' },
    ],
   },
  ],
  50: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1551323403033398',
    value: [
     { n: '冰天雪地', v: 'TOPC1551323403033398' },
     { n: '冰球冰球', v: 'TOPC1551323337921620' },
     { n: 'ATP周刊', v: 'TOPC1551324792732798' },
     { n: '约战果岭', v: 'TOPC1551324843068553' },
    ],
   },
  ],
  6: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451354597100320',
    value: [
     { n: '中国电影报道', v: 'TOPC1451354597100320' },
     { n: '今日影评', v: 'TOPC1470713254980521' },
     { n: '电影新闻', v: 'TOPC1470713363765346' },
     { n: '星推荐', v: 'TOPC1451469943519994' },
     { n: '剧说很好看', v: 'TOPC1495184612807684' },
     { n: '世界电影之旅', v: 'TOPC1451560112462173' },
     { n: '影视俱乐部', v: 'TOPC1451469901250966' },
     { n: '影视同期声', v: 'TOPC1451469804671799' },
     { n: '影视名堂', v: 'TOPC1451558049329358' },
     { n: '第10放映室', v: 'TOPC1451557487468814' }
    ],
   },
  ],
  7: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451526164984187',
    value: [
     { n: '防务新观察', v: 'TOPC1451526164984187' },
     { n: '讲武堂', v: 'TOPC1451526241359341' },
     { n: '军事报道', v: 'TOPC1451527941788652' },
     { n: '军事纪实', v: 'TOPC1451527993718730' },
     { n: '军事科技', v: 'TOPC1451528087494889' },
     { n: '谁是终极英雄', v: 'TOPC1451530272783201' },
     { n: '国防军事早报', v: 'TOPC1564109128610932' },
     { n: '正午国防军事', v: 'TOPC1564109254301161' },
     { n: '军事制高点', v: 'TOPC1564109356650207' },
     { n: '军武零距离', v: 'TOPC1564109434999268' },
     { n: '老兵你好', v: 'TOPC1564109722559395' },
     { n: '国防科工', v: 'TOPC1564109813378483' },
     { n: '军营的味道', v: 'TOPC1564110136027687' },
     { n: '国防微视频-军歌嘹亮', v: 'TOPC1564110222559767' },
     { n: '世界战史', v: 'TOPC1564110396694880' },
     { n: '第二战场', v: 'TOPC1564110615253124' },
     { n: '兵器面面观', v: 'TOPC1564110696628209' },
     { n: '五星剧场', v: 'TOPC1564110834985329' },
     { n: '军迷行天下', v: 'TOPC1564131644145429' },
     { n: '军事纪录', v: 'TOPC1575602995944674' },
     { n: '国防故事', v: 'TOPC1578551434601482' },
     { n: '砺剑', v: 'TOPC1649983616689859' },
    ],
   },
  ],
  8: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451469804671799',
    value: [
     { n: '影视同期声', v: 'TOPC1451469804671799' },
     { n: '影视俱乐部', v: 'TOPC1451469901250966' },
     { n: '星推荐', v: 'TOPC1451469943519994' },
     { n: '剧说很好看', v: 'TOPC1495184612807684' },
    ],
   },
  ],
  9: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1571389841186799',
    value: [
     { n: '微9', v: 'TOPC1571389841186799' },
    ],
   },
  ],
  10: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451557052519584',
    value: [
     { n: '百家讲坛', v: 'TOPC1451557052519584' },
     { n: '大家', v: 'TOPC1451557371520714' },
     { n: '地理中国', v: 'TOPC1451557421544786' },
     { n: '地理·中国', v: 'TOPC1451557421544786' },
     { n: '第10放映室', v: 'TOPC1451557487468814' },
     { n: '读书', v: 'TOPC1451557523542854' },
     { n: '健康之路', v: 'TOPC1451557646802924' },
     { n: '讲述', v: 'TOPC1451557691081955' },
     { n: '科技之光', v: 'TOPC1451557776198149' },
     { n: '人物', v: 'TOPC1451557861628208' },
     { n: '探索·发现', v: 'TOPC1451557893544236' },
     { n: '文明密码', v: 'TOPC1451557930785264' },
     { n: '我爱发明2021', v: 'TOPC1451557970755294' },
     { n: '原来如此', v: 'TOPC1451558088858410' },
     { n: '自然传奇', v: 'TOPC1451558150787467' },
     { n: '走近科学', v: 'TOPC1451558190239536' },
     { n: '味道', v: 'TOPC1482483166133803' },
     { n: '真相', v: 'TOPC1503545711557359' },
     { n: '人物·故事', v: 'TOPC1570780618796536' },
     { n: '时尚科技秀', v: 'TOPC1570874587435537' },
     { n: '创新进行时', v: 'TOPC1570875218228998' },
     { n: '解码科技史', v: 'TOPC1570876640457386' },
     { n: '实验现场', v: 'TOPC1571021159595290' },
     { n: '考古公开课', v: 'TOPC1571021251454875' },
     { n: '科幻地带', v: 'TOPC1571021323137369' },
     { n: '科学动物园', v: 'TOPC1571021385508957' },
     { n: '百家说故事', v: 'TOPC1574995326079121' },
     { n: '跟着书本去旅行', v: 'TOPC1575253587571324' },
     { n: '透视新科技', v: 'TOPC1576631973420833' },
     { n: '中国影像方志', v: 'TOPC1592552941644815' },
    ],
   },
  ],
  11: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451558363250650',
    value: [
     { n: '锦绣梨园', v: 'TOPC1451558363250650' },
     { n: '九州大戏台', v: 'TOPC1451558399948678' },
     { n: '一鸣惊人', v: 'TOPC1451558692971175' },
     { n: '空中剧院', v: 'TOPC1451558856402351' },
     { n: '梨园周刊', v: 'TOPC1574909786070351' },
     { n: '名家书场', v: 'TOPC1579401761622774' },
    ],
   },
  ],
  12: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451543462858283',
    value: [
     { n: '一线', v: 'TOPC1451543462858283' },
     { n: '天网', v: 'TOPC1451543228296920' },
     { n: '法律讲堂（生活版）', v: 'TOPC1451542824484472' },
     { n: '方圆剧阵', v: 'TOPC1571217727564820' },
     { n: '热线12', v: 'TOPC1451543168050863' },
     { n: '法律讲堂（文史版）', v: 'TOPC1451542861682530' },
     { n: '生命线', v: 'TOPC1571040589483598' },
     { n: '从心开始', v: 'TOPC1571217374070848' },
     { n: '道德观察', v: 'TOPC1451542784285432' },
     { n: '夕阳红', v: 'TOPC1451543312252987' },
     { n: '现场', v: 'TOPC1571301089686775' },
     { n: '心理访谈', v: 'TOPC1451543382680164' },
     { n: '见证', v: 'TOPC1451542933238628' },
     { n: '法治深壹度', v: 'TOPC1571535828826169' },
     { n: '小区大事', v: 'TOPC1451543346581129' },
     { n: '热心话', v: 'TOPC1511322878867827' },
     { n: '夜线', v: 'TOPC1451543426689237' },
     { n: '决不掉队', v: 'TOPC1485052424945417' },
     { n: '警察特训营', v: 'TOPC1461740566533993' },
     { n: '律师来了', v: 'TOPC1496896250071637' },
     { n: '全网追踪', v: 'TOPC1557975740970491' },
     { n: '从我做起', v: 'TOPC1451542713421371' },
     { n: '我是大律师', v: 'TOPC1464320273892779' },
     { n: '法治视界', v: 'TOPC1451542893998566' },
     { n: '普法栏目剧', v: 'TOPC1451543074960748' },
     { n: '庭审现场', v: 'TOPC1451543263837956' },
     { n: '忏悔录', v: 'TOPC1451542672944335' },
     { n: '实习志', v: 'TOPC1525335417343777' },
     { n: '鹰眼', v: 'TOPC1502421901609291' },
     { n: '平安365', v: 'TOPC1451542968215667' },
     { n: '闯关到12', v: 'TOPC1451542607107267' },
    ],
   },
  ],
  13: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451558976694518',
    value: [
     { n: '焦点访谈', v: 'TOPC1451558976694518' },
     { n: '高端访谈', v: 'TOPC1665739007799851' },
     { n: '新闻直播间', v: 'TOPC1451559129520755' },
     { n: '24小时', v: 'TOPC1451558428005729' },
     { n: '午夜新闻', v: 'TOPC1451558779639282' },
     { n: '朝闻天下', v: 'TOPC1451558496100826' },
     { n: '新闻周刊', v: 'TOPC1451559180488841' },
     { n: '共同关注', v: 'TOPC1451558858788377' },
     { n: '东方时空', v: 'TOPC1451558532019883' },
     { n: '法治在线', v: 'TOPC1451558590627940' },
     { n: '新闻30分', v: 'TOPC1451559097947700' },
     { n: '新闻1+1', v: 'TOPC1451559066181661' },
     { n: '世界周刊', v: 'TOPC1451558687534149' },
     { n: '环球视线', v: 'TOPC1451558926200436' },
     { n: '国际时讯', v: 'TOPC1451558887804404' },
     { n: '面对面', v: 'TOPC1451559038345600' },
     { n: '新闻调查', v: 'TOPC1451558819463311' },
     { n: '每周质量报告', v: 'TOPC1451558650605123' },
     { n: '军情时间到', v: 'TOPC1462504102545692' },
     { n: '新闻纪实', v: 'TOPC1451559259952964' },
    ],
   },
  ],
  14: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451559025546574',
    value: [
     { n: '动画大放映', v: 'TOPC1451559025546574' },
     { n: '大仓库', v: 'TOPC1451559344361150' },
     { n: '动感特区', v: 'TOPC1451559378830189' },
     { n: '动画剧场', v: 'TOPC1451559414465320' },
     { n: '动漫世界', v: 'TOPC1451559448233349' },
     { n: '快乐体验', v: 'TOPC1451559479171411' },
     { n: '绿野寻踪', v: 'TOPC1451559534065469' },
     { n: '七巧板', v: 'TOPC1451559569040502' },
     { n: '新闻袋袋裤', v: 'TOPC1451559603261584' },
     { n: '异想天开', v: 'TOPC1451559633994614' },
     { n: '音乐快递', v: 'TOPC1451559666055645' },
     { n: '英雄出少年', v: 'TOPC1451559695702690' },
     { n: '芝麻开门', v: 'TOPC1451559725520729' },
     { n: '智力快车', v: 'TOPC1451559756374759' },
     { n: '周末动画片', v: 'TOPC1451559836238828' },
     { n: 'SK极智少年强', v: 'TOPC1476950587121943' },
     { n: '风车剧场', v: 'TOPC1573528152700717' },
    ],
   },
  ],
  15: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451534421925242',
    value: [
     { n: 'CCTV音乐厅', v: 'TOPC1451534421925242' },
     { n: '歌声与微笑', v: 'TOPC1451541189657627' },
     { n: '今乐坛', v: 'TOPC1451541229451689' },
     { n: '精彩音乐汇', v: 'TOPC1451541414450906' },
     { n: '快乐琴童', v: 'TOPC1451541450128978' },
     { n: '乐游天下', v: 'TOPC1451541538046196' },
     { n: '民歌·中国', v: 'TOPC1451541994820527' },
     { n: '魔法奇迹', v: 'TOPC1451542029126607' },
     { n: '星光舞台', v: 'TOPC1451542099519708' },
     { n: '一起音乐吧', v: 'TOPC1451542132455743' },
     { n: '音乐传奇', v: 'TOPC1451542222069826' },
     { n: '音乐告诉你', v: 'TOPC1451542273313866' },
     { n: '音乐人生', v: 'TOPC1451542308412911' },
     { n: '影视留声机', v: 'TOPC1451542346007956' },
     { n: '中国音乐电视', v: 'TOPC1451542397206110' },
     { n: '音乐公开课', v: 'TOPC1462849800640766' },
     { n: '乐享汇', v: 'TOPC1528430065133683' },
     { n: '广场舞金曲', v: 'TOPC1528685010104859' },
     { n: '中国节拍', v: 'TOPC1570025984977611' },
     { n: '合唱先锋', v: 'TOPC1570026172793162' },
     { n: '聆听时刻', v: 'TOPC1570026397101703' },
     { n: '音乐周刊', v: 'TOPC1570593186033488' },
     { n: '童声唱', v: 'TOPC1570593464032566' },
    ],
   },
  ],
  16: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1462860742367700',
    value: [
     { n: '北京2022', v: 'TOPC1462860742367700' },
     { n: '艺术里的奥林匹克', v: 'TOPC1634807797280923' },
     { n: '逐冰追雪', v: 'TOPC1634807873035403' },
     { n: '五环纪事', v: 'TOPC1634807936107991' },
     { n: '奥秘无穷', v: 'TOPC1634808174904190' },
     { n: '奥林匹克人', v: 'TOPC1634808300961576' },
    ],
   },
  ],
  17: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1563178120425659',
    value: [
     { n: '科技链', v: 'TOPC1563178120425659' },
     { n: '乡土中国', v: 'TOPC1563178586782832' },
     { n: '印象·乡村', v: 'TOPC1563178734372977' },
     { n: '乡间纪事', v: 'TOPC1563178829094125' },
     { n: '田间示范秀', v: 'TOPC1563178908227191' },
     { n: '乡村剧场', v: 'TOPC1563179005948252' },
     { n: '乡村大舞台', v: 'TOPC1563179546003162' },
     { n: '农业气象', v: 'TOPC1568949200635957' },
     { n: '致富经', v: 'TOPC1568949310515140' },
     { n: '乡约', v: 'TOPC1568949394517190' },
     { n: '乡村振兴资讯', v: 'TOPC1568965444563295' },
     { n: '攻坚日记', v: 'TOPC1568966013656550' },
     { n: '遍地英雄', v: 'TOPC1568966086614400' },
     { n: '乡理乡亲', v: 'TOPC1568966155566515' },
     { n: '地球村日记', v: 'TOPC1568966232265609' },
     { n: '谁知盘中餐', v: 'TOPC1568966325430648' },
     { n: '大地讲堂', v: 'TOPC1568966472372643' },
     { n: '乡村振兴面对面', v: 'TOPC1568966531726705' },
     { n: '我爱发明', v: 'TOPC1569314345479107' },
     { n: '我的美丽乡村', v: 'TOPC1570787364956444' },
     { n: '超级新农人', v: 'TOPC1597627647957699' },
     { n: '三农群英汇', v: 'TOPC1600745974233265' },
     { n: '中国三农报道', v: 'TOPC1600746045741952' },
     { n: '田野里的歌声', v: 'TOPC1632628323813790' },
     { n: '振兴路上', v: 'TOPC1632709936747979' },
    ],
   },
  ],
  100: [
   {
    key: 'cateId',
    name: '',
    init: 'TOPC1451374975347585',
    value: [
     { n: '1起聊聊', v: 'TOPC1451374975347585' },
     { n: '分秒必争', v: 'TOPC1451379074008632' },
     { n: '环球科技视野', v: 'TOPC1451463780801881' },
     { n: '加油！少年派', v: 'TOPC1451464548229761' },
     { n: '精彩一刻', v: 'TOPC1451464786232149' },
     { n: '魅力纪录', v: 'TOPC1451465982926341' },
     { n: '环宇视野', v: 'TOPC1451469241240836' },
     { n: '人文地理', v: 'TOPC1451469288523874' },
     { n: '全景自然', v: 'TOPC1451469617360656' },
     { n: '自然', v: 'TOPC1451469660736687' },
     { n: '收藏传奇', v: 'TOPC1451526640730841' },
     { n: '为了你', v: 'TOPC1451527001597710' },
     { n: '我们有一套', v: 'TOPC1451527089955940' },
     { n: '状元360', v: 'TOPC1451528493821255' },
     { n: '百年歌声', v: 'TOPC1451534465694290' },
     { n: '动画城', v: 'TOPC1451542209144770' },
     { n: '快乐驿站', v: 'TOPC1451542273075862' },
     { n: '创新无限', v: 'TOPC1451557109280614' },
     { n: '科技人生', v: 'TOPC1451557739596986' },
     { n: '绿色空间', v: 'TOPC1451557825546179' },
     { n: '希望-英语杂志', v: 'TOPC1451558013229330' },
     { n: '影视名堂', v: 'TOPC1451558049329358' },
     { n: '重访', v: 'TOPC1451558118808439' },
     { n: '宝贝一家亲', v: 'TOPC1451559867985861' },
     { n: '成长在线', v: 'TOPC1451559901017891' },
     { n: '动漫星空', v: 'TOPC1451559936284927' },
     { n: '童心回放', v: 'TOPC1451559966897957' },
     { n: '文学宝库', v: 'TOPC1451560002205989' },
     { n: '世界电影之旅', v: 'TOPC1451560112462173' },
     { n: '巅峰音乐汇', v: 'TOPC1451984095463376' },
     { n: '欢乐一家亲', v: 'TOPC1451984214170587' },
     { n: '欢乐英雄', v: 'TOPC1451984242834620' },
     { n: '欢乐中国行', v: 'TOPC1451984301286720' },
     { n: '激情广场', v: 'TOPC1451984341218765' },
     { n: '开心辞典', v: 'TOPC1451984378754815' },
     { n: '曲苑杂谈', v: 'TOPC1451984417763860' },
     { n: '曲苑杂坛', v: 'TOPC1451984417763860' },
     { n: '天天乐', v: 'TOPC1451984447718918' },
     { n: '文化讲坛', v: 'TOPC1451984533334125' },
     { n: '笑星大联盟', v: 'TOPC1451984731428297' },
     { n: '中国好歌曲', v: 'TOPC1451984949453678' },
     { n: '综艺星天地', v: 'TOPC1451985188986150' },
     { n: '秘境之眼', v: 'TOPC1554187056533820' },
    ],
   },
  ],
 };
 return JSON.stringify({
  class: _.map(classes, (cls) => {
   cls.land = 1;
   cls.ratio = 1.78;
   return cls;
  }),
  filters: filterObj,
 });
}

async function category(inReq, _outResp) {
 let pg = inReq.body.page;
 if (pg <= 0 || typeof pg == 'undefined') pg = 1;

 const tid = inReq.body.id;
 const extend = inReq.body.filters;

 if (pg <= 0) pg = 1;

 const data = await request(HOST + '/NewVideo/getVideoListByColumn?id=' + extend['cateId'] + '&n=10&sort=desc&p=' + pg + '&mode=0&serviceId=tvcctv');
 let videos = _.map(data.data.list, (it) => {
  return {
   vod_id: it.guid,
   vod_name: it.title,
   vod_pic: it.image,
   vod_remarks: it.time || '',
  };
 });
 const pgChk = (await request(HOST + '/NewVideo/getVideoListByColumn?id=' + extend['cateId'] + '&n=10&sort=desc&p=' + (parseInt(pg) + 1) + '&mode=0&serviceId=tvcctv')).data.list;
 const pgCount = pgChk.length > 0 ? parseInt(pg) + 1 : parseInt(pg);
 return JSON.stringify({
  page: parseInt(pg),
  pagecount: parseInt(pgCount),
  limit: 10,
  total: parseInt(data.total),
  list: videos,
 });
}

async function detail(inReq, _outResp) {
 // const id = !Array.isArray(inReq.body.id) ? [inReq.body.id] : inReq.body.id;
 const id = inReq.body.id;

 const vod = {
  vod_id: id,
  vod_remarks: '',
 };
//const playlist = ['点击播放' + '$' + 'https://hls.cntv.kcdnvip.com/asp/hls/main/0303000a/3/default/' + id + '/main.m3u8?maxbr=2048'];
const playlist = ['点击播放' + '$' + 'https://hls.cntv.myhwcdn.cn/asp/hls/2000/0303000a/3/default/' + id + '/main.m3u8?maxbr=2048'];
vod.vod_play_from = key;
 vod.vod_play_url = playlist.join('#');
 return JSON.stringify({
  list: [vod],
 });
}
async function play(inReq, _outResp) {
 // console.debug('视聚场 id =====>' + id); // js_debug.log
 const id = inReq.body.id;
 return JSON.stringify({
  parse: 0,
  url: id,
 });
}

async function search(wd, quick, pg) {
 return '{}';
}

async function test(inReq, outResp) {
 try {
  const printErr = function (json) {
   if (json.statusCode && json.statusCode == 500) {
    console.error(json);
   }
  };
  const prefix = inReq.server.prefix;
  const dataResult = {};
  let resp = await inReq.server.inject().post(`${prefix}/init`);
  dataResult.init = resp.json();
  printErr(resp.json());
  resp = await inReq.server.inject().post(`${prefix}/home`);
  dataResult.home = resp.json();
  printErr('' + resp.json());
  if (dataResult.home.class.length > 0) {
   resp = await inReq.server.inject().post(`${prefix}/category`).payload({
    id: dataResult.home.class[0].type_id,
    page: 1,
    filter: true,
    filters: {},
   });
   dataResult.category = resp.json();
   printErr(resp.json());
   if (dataResult.category.list.length > 0) {
    resp = await inReq.server.inject().post(`${prefix}/detail`).payload({
     id: dataResult.category.list[0].vod_id, // dataResult.category.list.map((v) => v.vod_id),
    });
    dataResult.detail = resp.json();
    printErr(resp.json());
    if (dataResult.detail.list && dataResult.detail.list.length > 0) {
     dataResult.play = [];
     for (const vod of dataResult.detail.list) {
      const flags = vod.vod_play_from.split('$$$');
      const ids = vod.vod_play_url.split('$$$');
      for (let j = 0; j < flags.length; j++) {
       const flag = flags[j];
       const urls = ids[j].split('#');
       for (let i = 0; i < urls.length && i < 2; i++) {
        resp = await inReq.server
         .inject()
         .post(`${prefix}/play`)
         .payload({
          flag: flag,
          id: urls[i].split('$')[1],
         });
        dataResult.play.push(resp.json());
       }
      }
     }
    }
   }
  }
  resp = await inReq.server.inject().post(`${prefix}/search`).payload({
   wd: '暴走',
   page: 1,
  });
  dataResult.search = resp.json();
  printErr(resp.json());
  return dataResult;
 } catch (err) {
  console.error(err);
  outResp.code(500);
  return { err: err.message, tip: 'check debug console output' };
 }
}

export default {
 meta: {
  key: 'cntvlm',
  name: '央视栏目',
  type: 3,
 },
 api: async (fastify) => {
  fastify.post('/init', init);
  fastify.post('/home', home);
  fastify.post('/category', category);
  fastify.post('/detail', detail);
  fastify.post('/play', play);
  fastify.post('/search', search);
  fastify.get('/test', test);
 },
};
